// מהי קומפוננטה?
// רכיב תצוגה
// component

// שני סוגים של קומפוננטות
// 1. קומפוננטות קלאסיות - class - שיטה ישנה
// 2. קומפוננטות פונקציונאליות - function - שיטה חדשה

// יצירת קומפוננטה חדשה
// מקובל ליצור כל קומפוננטה בקובץ נפרד
// אלא אם כן מדובר בקומפוננטות קטנות או קומפוננטה שמיועדת לצורך פנימי
// ...
// שם הקובץ - מקובל כשם הקומפוננטה
// סיומת - JSX
// JSX - js xml
// js - לוגיקה
// xml - שפת תגיות
// html - xml הרחבה של 

// קומפוננטה היא פונקציה שמחזירה הטמל

// שם קומפוננטה תמיד תמיד תמיד באות גדולה!
// להבדיל מתגיות של הטמל - באות קטנה

// שם הקובץ - כשם הקומפוננטה - מקובל
// לא לשנות שם קובץ לעולם לעולם לעולם!!!

// מהי קומפוננטה?
// ביצירה - מתנהגת כמו פונקציה (שמחזירה הטמל)
// בשימוש - מתנהגת כמו תגית

export function Comp() {
    // return האלמנט שמוחזר מהקומפוננטה חייב להתחיל בשורה של המילה השמורה
    // return - שגיאה
    // <p>this is my first component!</p>

    // אופציה א
    // return <p>
    //     this is my first component!
    // </p>

    // אופציה ב - סוגריים עגולות
    return (
        <p>this is my first component</p>
    )
}

export function Comp2() {
    return <p>this is my second component!</p>
}